blog/2021/nginx-http2.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-06 Sun 16:37 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>通过 Nginx 让网站支持 HTTP/2</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">通过 Nginx 让网站支持 HTTP/2</h1>
</header><p>
<a href="https://www.nginx.com/blog/http2-module-nginx/">https://www.nginx.com/blog/http2-module-nginx/</a>
</p>

<p>
目前，HTTP 的主流版本是 1.1。它是 1997 年发布的。站点使用 Nginx 作为 Web 服务器，让它支持 HTTP/2 是非常简单的。
</p>

<p>
只需要在 Nginx 的配置文件中（一般位于 <code>/etc/nginx/nginx.conf</code> ）的对应位置添加 <code>http2</code> 即可。
</p>

<p>
但是，在此之前，需检查 Nginx 是否支持 http2，并且 Openssh 的版本是否达到最低要求（&gt;=1.0.2）。
</p>

<div class="org-src-container">
<pre class="src src-sh">nginx -V
... --with-http_v2_module
</pre>
</div>

<p>
如果能在输出中找到 <code>--with-http_v2_module</code> 就说明当前版本 Nginx 支持开启 HTTP/2。
</p>

<p>
具体操作如下：
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #ad8572;">http</span> {
  <span style="color: #ad8572;">server</span> {
    listen 443 ssl http2;
  }
}
</pre>
</div>

<p>
修改完成后，执行 <code>sudo systemctl restart nginx</code> 来重启 Nginx。
</p>

<p>
如何检查网站是否支持 HTTP/2？
</p>

<p>
可以通过开发者工具，对于 Firefox 可通过 F12 打开，在 Network 标签页下面，可以看到由 Status、Method、Domain 等组成的列表，其中有一项为 Protocol，如果修改成功，这一栏的值会由 HTTP/1.1 变为 HTTP/2。</p>
</div>
</body>
</html>